Repository: tpwd/ke_search
Catalog: Resources/Private/Language/*.locallang_db.xlf
Languages: ru

# pages.tx_kesearch_label
source: Search
ru: Искать

# pages.tx_kesearch_tags
source: Tags for faceted search
ru: Теги для фасетного поиска

# pages.tx_kesearch_resultimage
source: Search result image
ru: Изображение к результатам поиска

# pages.tx_kesearch_abstract
source: Abstract for search result
ru: Аннотация к результату поиска

# sys_file_metadata.tx_kesearch_label
source: Search
ru: Искать

# sys_file_metadata.tx_kesearch_no_search
source: Include in search
ru: Включить в поиск

# sys_category.tx_kesearch_filter
source: Category acts as a filter option for these filters
ru: Категория выступает дополнительной опцией для этих фильтров

# sys_category.tx_kesearch_filtersubcat
source: Sub-Categories act as a filter options for these filters
ru: Подкатегории выступают дополнительными опциями для этих фильтров

# tt_content.list_type_pi1
source: Faceted search - Searchbox and Filters
ru: Фасетный поиск - блок поиска с фильтрами

# tt_content.list_type_pi2
source: Faceted search - Results
ru: Фасетный поиск - Результаты

# tt_content.list_type_pi3
source: Faceted search - Cachable Searchbox and filters
ru: Фасетный поиск - Кешируемый блок поиска с фильтрами

# tx_kesearch_filters
source: Filters
ru: Фильтры

# tx_kesearch_filters.title
source: Title
ru: Заголовок

# tx_kesearch_filters.rendertype
source: Rendering type
ru: Тип отображения

# tx_kesearch_filters.markAllCheckboxes
source: Mark all checkboxes by default?
ru: Проставить все флажки по умолчанию?

# tx_kesearch_filters.options
source: Filter options
ru: Параметры фильтра

# tx_kesearch_filters.target_pid
source: Choose page where to show all filter options
ru: Выберите страницу для вывода всех параметров фильтрации

# tx_kesearch_filters.amount
source: How many textlinks should be displayed?
ru: Сколько текстовых ссылок должно выводиться?

# tx_kesearch_filters.shownumberofresults
source: Show number of results for each filter option?
ru: Показать количество результатов для каждой опции фильтра?

# tx_kesearch_filters.alphabeticalsorting
source: Sort filteroptions alphabetically?
ru: Сортировать параметры фильтрации по алфавиту?

# tx_kesearch_filters.rendertype.I.0
source: Select/Dropdown
ru: Выбор/Выпадающий список

# tx_kesearch_filters.rendertype.I.1
source: List/Textlinks
ru: Списк/Текстовые ссылки

# tx_kesearch_filters.rendertype.I.2
source: Checkboxes (multiselection OR)
ru: Флажки (выбор нескольких параметров через ИЛИ)

# tx_kesearch_filters.rendertype.I.3
source: Date range
ru: Диапазон дат

# tx_kesearch_filteroptions
source: Filter options
ru: Параметры фильтра

# tx_kesearch_filteroptions.title
source: Title
ru: Заголовок

# tx_kesearch_filteroptions.tag
source: Tag
ru: Тег

# tx_kesearch_filteroptions.slug
source: URL Segment (Slug)
ru: URL сегмент (Slug)

# tx_kesearch_filteroptions.automated_tagging
source: Set tag for this page and all children
ru: Установить тег для этой страницы и всех ее потомков

# tx_kesearch_filteroptions.automated_tagging_exclude
source: Exclude tag for all children of this page
ru: Исключить тег для всех потомков этой страницы

# tx_kesearch_index
source: Index
ru: Индекс

# tx_kesearch_index.relevance
source: Relevance
ru: Актуальность

# tx_kesearch_index.targetpid
source: Target PID
ru: Целевая PID

# tx_kesearch_index.content
source: Indexed content
ru: Индексированное содержимое

# tx_kesearch_index.hidden_content
source: Indexed hidden content
ru: Индексированное скрытое содержимое

# tx_kesearch_index.hidden_content.description
source: Will be searched but not shown in the frontend
ru: Будет доступно для поиска но не будет выводиться на сайте

# tx_kesearch_index.params
source: Parameters
ru: Параметры

# tx_kesearch_index.type
source: Type
ru: Тип

# tx_kesearch_index.tags
source: Tags
ru: Теги

# tx_kesearch_index.abstract
source: Abstract
ru: Аннотация

# tx_kesearch_index.title
source: Title
ru: Заголовок

# tx_kesearch_index.language
source: Language UID
ru: UID языка

# tx_kesearch_index.sortdate
source: Date
ru: Дата

# tx_kesearch_index.directory
source: Directory
ru: Каталог

# tx_kesearch_indexerconfig
source: Indexer Configuration
ru: Конфигурация индексатора

# tx_kesearch_indexerconfig.tabs.advanced
source: Advanced
ru: Дополнительно

# tx_kesearch_indexerconfig.title
source: Title
ru: Заголовок

# tx_kesearch_indexerconfig.storagepid
source: Storage
ru: Хранилище

# tx_kesearch_indexerconfig.storagepid.description
source: Storage page for search data (the index)
ru: Страница хранения данных поиска (индекса)

# tx_kesearch_indexerconfig.targetpid
source: Target page for extension content
ru: Целевая страница для содержимого расширения

# tx_kesearch_indexerconfig.startingpoints_recursive
source: Pages/folders recursive
ru: Страницы/папки рекурсивно

# tx_kesearch_indexerconfig.startingpoints_recursive.description
source: Pages/folders and sub-pages/sub-folders to be indexed (recursive)
ru: Страницы/папки и подстраницы/вложенные папки, которые будут индексированы (рекурсивно)

# tx_kesearch_indexerconfig.single_pages
source: Single pages
ru: Отдельные страницы

# tx_kesearch_indexerconfig.single_pages.description
source: Pages to be indexed (non-recursive)
ru: Страницы для индексирования (не рекурсивно)

# tx_kesearch_indexerconfig.sysfolder
source: Single folders
ru: Отдельные папки

# tx_kesearch_indexerconfig.sysfolder.description
source: Folders to be indexed (non-recursive)
ru: Папки для индексирования (не рекурсивно)

# tx_kesearch_indexerconfig.type.I.0
source: Pages
ru: Страницы

# tx_kesearch_indexerconfig.type.I.2
source: News (tt_news)
ru: Новости (tt_news)

# tx_kesearch_indexerconfig.type.I.5
source: Address records (tt_address)
ru: Записи адресов (tt_address)

# tx_kesearch_indexerconfig.type.I.6
source: Content records (tt_content)
ru: Записи содержимого (tt_content)

# tx_kesearch_indexerconfig.type.I.7
source: Files
ru: Файлы

# tx_kesearch_indexerconfig.type.I.12
source: News (news)
ru: Новости (news)

# tx_kesearch_indexerconfig.type
source: Type
ru: Тип

# tx_kesearch_indexerconfig.index_content_with_restrictions
source: Index content elements with restrictions?
ru: Индексировать элементы содержимого с ограничениями?

# tx_kesearch_indexerconfig.index_content_with_restrictions.description
source: Content elements will be indexed even if they have frontend user group access restrictions. This function may be used to "tease" content elements and then tell the user that a login is needed.
ru: Элементы контента будут индексированы, даже если у них есть ограничения доступа к группам пользователей. Эта функция может быть использована для "дразнящих" элементов содержимого, сообщающих, что для доступа к ним нужна авторизация.

# tx_kesearch_indexerconfig.index_content_with_restrictions.I.0
source: Yes
ru: Да

# tx_kesearch_indexerconfig.index_content_with_restrictions.I.1
source: No
ru: Нет

# tx_kesearch_indexerconfig.index_news_category_mode
source: Category mode
ru: Режим категорий

# tx_kesearch_indexerconfig.index_news_category_mode.I.1
source: Index all news records
ru: Индексировать все записи новостей

# tx_kesearch_indexerconfig.index_news_category_mode.I.2
source: Index only news with selected categories
ru: Индексировать только новости в выбранных категориях

# tx_kesearch_indexerconfig.index_news_archived
source: Archived news settings
ru: Настройки архивированных новостей

# tx_kesearch_indexerconfig.index_news_archived.I.0
source: Index all news
ru: Индексация всех новостей

# tx_kesearch_indexerconfig.index_news_archived.I.1
source: Index only active news
ru: Индекация только активных новостей

# tx_kesearch_indexerconfig.index_news_archived.I.2
source: Index only archived news
ru: Индекс только для архивированных новостей

# tx_kesearch_indexerconfig.index_news_category_selection
source: Categories
ru: Категории

# tx_kesearch_indexerconfig.index_news_useHRDatesSingleWithoutDay
source: Use dates without day for single-view-URLs
ru: Использовать даты без дня для показа URL-адресов подробных результатов

# tx_kesearch_indexerconfig.index_news_files_mode
source: Attached files should be handled as
ru: Прикрепленные файлы должны обрабатываться как

# tx_kesearch_indexerconfig.index_news_files_mode.I.0
source: Separate search result
ru: Раздельный результат поиска

# tx_kesearch_indexerconfig.index_news_files_mode.I.1
source: Content of news record
ru: Содержимое записи новостей

# tx_kesearch_indexerconfig.index_extnews_category_selection
source: Categories
ru: Категории

# tx_kesearch_indexerconfig.index_use_page_tags
source: Add tags of parent pages/folders?
ru: Добавить теги родительских страниц/папок?

# tx_kesearch_indexerconfig.index_use_page_tags_for_files
source: Add tags to files also?
ru: Добавить теги и для файлов?

# tx_kesearch_indexerconfig.index_page_doctypes
source: Page types which should be indexed
ru: Типы индексируемых страниц

# tx_kesearch_indexerconfig.index_page_doctypes.description
source: Refers to the field "doktype" in the "pages" table, default: 1
ru: Ссылка на поле "doktype" в таблице "pages", по умолчанию: 1

# tx_kesearch_indexerconfig.directories
source: Directories
ru: Каталоги

# tx_kesearch_indexerconfig.directories.description
source: comma-separated, if FAL is used, name the directories as inside the file storage, e.g.: 'my_directory/,my_other_directory/'. If FAL is not used, you need to add the storage folder, e.g.: 'fileadmin/user_upload/,fileadmin/examples/'
ru: запятые, если используется FAL, именуйте каталоги как внутри хранилища файлов, например: 'my_directory/,my_other_directory/'. Если FAL не используется, необходимо добавить папки хранилища, например: 'fileadmin/user_upload/,fileadmin/examples/'

# tx_kesearch_indexerconfig.fileext
source: File indexer: Comma separated list of allowed file extensions (eg. pdf,ppt,doc,xls)
ru: Индексатор файла: список разрешенных расширений файлов через запятую (например, pdf,ppt,doc,xls)

# tx_kesearch_indexerconfig.contenttypes
source: Content element types which should be indexed
ru: Типы индексируемых элементов содержимого

# tx_kesearch_indexerconfig.file_reference_fields
source: tt_content fields which should be indexed for file references
ru: Индексируемые поля tt_content со ссылками на файлы

# tx_kesearch_indexerconfig.file_reference_fields.description
source: default: media
ru: по умолчанию: media

# tx_kesearch_indexerconfig.content_fields
source: tt_content fields which should be indexed
ru: Индексируемые поля tt_content

# tx_kesearch_indexerconfig.filteroption
source: Add tag to all indexed elements
ru: Добавить тег ко всем проиндексированным элементам

# tx_kesearch_indexerconfig.fal_storage
source: File storage (FAL)
ru: Хранилище файлов (FAL)

# tx_kesearch_indexerconfig.fal_storage.dont_use_fal
source: Dont' use FAL but read files directly
ru: Не использовать FAL, обращаться напрямую к файлам
